const tempOptionsMap = {
  1: ["30", "40"],   // step จริง ["20", "30", "40"]
  2: ["30", "40"],   // step จริง ["20", "30", "40"]
  3: ["30", "40"],   // step จริง ["20", "30", "40"]
  4: ["30", "40", "60"],   // step จริง ["20", "30", "40", "60"]  
  5: ["30", "40", "60"],   // step จริง ["20", "30", "40", "60"]
  6: ["30", "40"],   // step จริง ["20", "30", "40"]  
  7: ["30", "40", "60", "90"],   // step จริง ["20", "30", "40", "60", "90"]
  8: ["30", "40", "60"]   // step จริง ["20", "30", "40", "60"]
  // 9: ["20"] เอาออกเพราะเพิ่ม 20 องศา ก็เหมือนไม่เพิิ่ม ไม่ควรคิดเงิน
};

const tempShowOptionsMap = {
  1: ["🌡️ เพิ่มอุณหภูมิ"],
  2: ["🌡️ เพิ่มอุณหภูมิ"],
  3: ["🌡️ เพิ่มอุณหภูมิ"],
  4: ["🌡️ เพิ่มอุณหภูมิ"],
  5: ["🌡️ เพิ่มอุณหภูมิ"],
  6: ["🌡️ เพิ่มอุณหภูมิ"],
  7: ["🌡️ เพิ่มอุณหภูมิ"],
  8: ["🌡️ เพิ่มอุณหภูมิ"]
  // 9: ["🌡️ เพิ่มอุณหภูมิ"]
};

const aromaOptionsMap = {
  1: ["เพิ่ม Aroma (+5 บาท)"],   // step จริง ["20", "30", "40"]
  // 2: [null],
  // 3: [null],
  5: ["เพิ่ม Aroma (+5 บาท)"],
  7: ["เพิ่ม Aroma (+5 บาท)"],
  8: ["เพิ่ม Aroma (+5 บาท)"]
  // 9: [null]
};

const programNameMap = {
  0:  null,
  1: "ชุดกีฬา",
  2: "ผ้าขนสัตว์",
  3: "ผ้าบอบบาง",
  4: "ซักแบบประหยัด",
  5: "ผ้าผสม 45 นาที",
  6: "ซักด่วน 15 นาที",
  7: "ผ้าฝ้าย",
  8: "ผ้าขาว",
  9: "ซักถนอมสีผ้า",
  10: "ซักอบไอน้ำ"
};

const tempPriceMap = {
  "20": 3,
  "30": 4,
  "40": 8,
  "60": 15,
  "90": 20
};

const tempCycleMap = {
  1: ["20", "20", "30", "40", "normal"],
  2: ["40", "40", "normal", "20", "30"],
  3: ["30", "30", "40", "normal", "20"],
  4: ["30", "30", "40", "60", "normal", "20"],
  5: ["30", "30", "40", "60", "normal", "20"],
  6: ["normal", "normal", "20", "30", "40"],
  7: ["40", "40", "60", "90", "normal", "20", "30"],
  8: ["30", "30", "40", "60", "normal", "20"],
  9: ["normal", "normal"],
  10: ["normal", "normal"]  
};

const defaultTempMap = {
  1: "20",
  2: "40",
  3: "30",
  4: "30",
  5: "30",
  6: "normal",
  7: "40",
  8: "30",
  9: "normal",
  10: null
};

export {
  tempOptionsMap,
  tempShowOptionsMap,
  aromaOptionsMap,
  programNameMap,
  tempPriceMap,
  tempCycleMap,
  defaultTempMap
};